Benchmark_testing_result.txt
Отдача статического документа напрямую через nginx;

$ ab -c 200 -n 4000 http://127.0.0.1/static/css/bootstrap.min.css
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 400 requests
Completed 800 requests
Completed 1200 requests
Completed 1600 requests
Completed 2000 requests
Completed 2400 requests
Completed 2800 requests
Completed 3200 requests
Completed 3600 requests
Completed 4000 requests
Finished 4000 requests


Server Software:        nginx/1.24.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /static/css/bootstrap.min.css
Document Length:        232803 bytes

Concurrency Level:      200
Time taken for tests:   0.310 seconds
Complete requests:      4000
Failed requests:        0
Total transferred:      932160000 bytes
HTML transferred:       931212000 bytes
Requests per second:    12897.65 [#/sec] (mean)
Time per request:       15.507 [ms] (mean)
Time per request:       0.078 [ms] (mean, across all concurrent requests)
Transfer rate:          2935223.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       3
Processing:     7   14   4.9     13      42
Waiting:        0    2   5.9      1      32
Total:          8   15   5.2     14      43

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     15
  80%     15
  90%     17
  95%     26
  98%     39
  99%     41
 100%     43 (longest request)


Отдача статического документа напрямую через gunicorn;

ab -c 200 -n 4000 http://127.0.0.1:8000/static/css/bootstrap.min.css
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 400 requests
Completed 800 requests
Completed 1200 requests
Completed 1600 requests
Completed 2000 requests
Completed 2400 requests
Completed 2800 requests
Completed 3200 requests
Completed 3600 requests
Completed 4000 requests
Finished 4000 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /static/css/bootstrap.min.css
Document Length:        4315 bytes

Concurrency Level:      200
Time taken for tests:   7.789 seconds
Complete requests:      4000
Failed requests:        0
Non-2xx responses:      4000
Total transferred:      18416000 bytes
HTML transferred:       17260000 bytes
Requests per second:    513.55 [#/sec] (mean)
Time per request:       389.446 [ms] (mean)
Time per request:       1.947 [ms] (mean, across all concurrent requests)
Transfer rate:          2308.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:     5  378  57.3    371     491
Waiting:        5  378  57.3    371     491
Total:          8  378  57.0    371     491

Percentage of the requests served within a certain time (ms)
  50%    371
  66%    377
  75%    381
  80%    428
  90%    450
  95%    464
  98%    468
  99%    470
 100%    491 (longest request)


Отдача динамического документа напрямую через gunicorn;

ab -c 200 -n 4000 http://127.0.0.1:8000/
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
^C

Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /
Document Length:        21024 bytes

Concurrency Level:      200
Time taken for tests:   21.496 seconds
Complete requests:      63
Failed requests:        0
Total transferred:      1343223 bytes
HTML transferred:       1324512 bytes
Requests per second:    2.93 [#/sec] (mean)
Time per request:       68242.219 [ms] (mean)
Time per request:       341.211 [ms] (mean, across all concurrent requests)
Transfer rate:          61.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   0.6      4       5
Processing:   751 10635 6012.5  10709   20720
Waiting:      744 10634 6012.6  10708   20720
Total:        751 10639 6012.2  10713   20723

Percentage of the requests served within a certain time (ms)
  50%  10712
  66%  14007
  75%  16021
  80%  16753
  90%  18739
  95%  20058
  98%  20723
  99%  20723
 100%  20723 (longest request)

Отдача динамического документа через проксирование запроса с nginx на gunicorn;

ab -c 200 -n 4000 http://127.0.0.1/
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 400 requests
Completed 800 requests
Completed 1200 requests
Completed 1600 requests
Completed 2000 requests
Completed 2400 requests
Completed 2800 requests
Completed 3200 requests
Completed 3600 requests
Completed 4000 requests
Finished 4000 requests


Server Software:        nginx/1.24.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        21024 bytes

Concurrency Level:      200
Time taken for tests:   0.920 seconds
Complete requests:      4000
Failed requests:        0
Total transferred:      85300000 bytes
HTML transferred:       84096000 bytes
Requests per second:    4346.65 [#/sec] (mean)
Time per request:       46.012 [ms] (mean)
Time per request:       0.230 [ms] (mean, across all concurrent requests)
Transfer rate:          90519.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       4
Processing:     2    7  12.4      7     785
Waiting:        1    6  12.4      7     779
Total:          5    7  12.4      7     785

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      7
  80%      7
  90%      8
  95%     10
  98%     13
  99%     13
 100%    785 (longest request)


Отдача динамического документа через проксирование запроса с nginx на gunicorn, при кэшировние ответа на nginx (proxy cache);

ab -c 200 -n 4000 http://127.0.0.1/
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 400 requests
Completed 800 requests
Completed 1200 requests
Completed 1600 requests
Completed 2000 requests
Completed 2400 requests
Completed 2800 requests
Completed 3200 requests
Completed 3600 requests
Completed 4000 requests
Finished 4000 requests


Server Software:        nginx/1.24.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        21024 bytes

Concurrency Level:      200
Time taken for tests:   0.146 seconds
Complete requests:      4000
Failed requests:        0
Total transferred:      85300000 bytes
HTML transferred:       84096000 bytes
Requests per second:    27420.74 [#/sec] (mean)
Time per request:       7.294 [ms] (mean)
Time per request:       0.036 [ms] (mean, across all concurrent requests)
Transfer rate:          571042.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:     2    7   1.1      7       9
Waiting:        0    7   1.2      7       8
Total:          5    7   0.8      7       9

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      8
  80%      8
  90%      8
  95%      8
  98%      8
  99%      9
 100%      9 (longest request)


Итог:
Использование nginx и proxy_cache значительно улучшают производительность систмеы. 
Оч крутое дз, потому что на пальцах можно понять важность кэширования и правильной архитектуры системы